n1=5;n2=4;n3=4; %每个总体的样本容量
p=3;k=3; %三元三总体
n=n1+n2+n3;  %总的样本容量

% 样本数据阵
xa=[47.22,5.06,0.10;
    47.45,4.35,0.15;
    47.52,6.85,0.12;
    47.86,4.19,0.17;
    47.31,7.57,0.18];
xb=[54.33,6.22,0.12;
    56.17,3.31,0.15;
    54.40,2.43,0.22;
    52.62,5.92,0.12];
xc=[43.12,10.33,0.05;
    42.05,9.67,0.08;
    42.50,9.62,0.02;
    40.77,9.68,0.04];
xx=[xa;xb;xc];

%计算样本均值
mu1 = mean(xa);
mu2 = mean(xb);
mu3 = mean(xc);
mut = mean(xx);

%计算样本离差针
a1 = xa'*xa-n1*mean(xa)'*mean(xa);
a2 = xb'*xb-n2*mean(xb)'*mean(xb);
a3 = xc'*xc-n3*mean(xc)'*mean(xc);
tt = xx'*xx-n*mean(xx)'*mean(xx);
a = a1+a2+a3;

%计算样本协方差阵
s1 = a1/(n1-1);
s2 = a2/(n2-1);
s3 = a3/(n3-1);
s = a/(n-k);



%<!--------问题1-------->
%计算行列式
sa = det(s1);
sb = det(s2);
sc = det(s3);
s = det(s);

% 统计量(1-d)*M
m = (n-k)*log(s)-(n1-1)*log(sa)-(n2-1)*log(sb)-(n3-1)*log(sc);
d = (2*p^2+3*p-1)*(1/(n1-1)+1/(n2-1)+1/(n3-1)-1/(n-k))/(6*(p+1)*(k-1));
kexi = (1-d)*m;

% 近似开方分布自由度
df = p*(p+1)*(k-1)/2;

% 显著性水平p1
p1=1-chi2cdf(kexi,df)



%<!--------问题2-------->
% 计算合并协方差矩阵
aa=a1+a2;

% 计算霍特林统计量
dd = (mu1-mu2)*pinv(aa)*(mu1-mu2)';
t2 = (n1+n2-2)*n1*n2*dd/(n1+n2);

% 转换成f分布
f2=(n1+n2-1-p)*t2/((n1+n2-2)*p);

% 显著性水平
p2=1-fcdf(f2,p,n1+n2-p-1)




%<!--------问题3-------->
da=det(a);
dt=det(tt);
a0=da/dt;

b=sqrt(a0);
f3=(n-k-p+1)*(1-b)/(b*p);

df1=2*p;
df2=2*(n-k-p+1);

p3=1-fcdf(f3,df1,df2)


%<!--------问题4-------->
a0=det(a);
a1=a(1,1)*a(2,2)*a(3,3);

v=a0/a1;
b=n-1.5-(p*p*p-3)/(3*p*p-3*3);
kc=-b*log(v);

df4=0.5*(p*(p+1)-2*3);
p4=1-chi2cdf(kc,df4)
